{"name":"Bearded Devil","abilityScores":[{"abilityType":"str","score":16},{"abilityType":"dex","score":15},{"abilityType":"con","score":15},{"abilityType":"int","score":9},{"abilityType":"wis","score":11},{"abilityType":"cha","score":11}],"stats":[{"statType":"ac","statValue":"13"},{"statType":"hp","statValue":"8d8+16"},{"statType":"speed","statValue":"30 ft."}],"features":[{"name":"Saves","description":"Str 5, Con 4, Wis 2"},{"name":"DamageResistances","description":"cold, bludgeoning, piercing, and slashing from nonmagical weapons that aren\u0027t silvered"},{"name":"DamageImmunities","description":"fire, poison"},{"name":"ConditionImmunities","description":"poisoned"},{"name":"Senses","description":"darkvision 120 ft."},{"name":"Languages","description":"Infernal, telepathy 120 ft."},{"name":"Challenge Rating","description":"3"},{"name":"Devil\u0027s Sight","description":"Magical darkness doesn\u0027t impede the devil\u0027s darkvision."},{"name":"Magic Resistance","description":"The devil has advantage on saving throws against spells and other magical effects."},{"name":"Steadfast","description":"The devil can\u0027t be frightened while it can see an allied creature within 30 feet of it."}],"actions":[{"name":"Multiattack","toHit":"","reach":"","hit":"","description":"The devil makes two attacks: one with its beard and one with its glaive."},{"name":"Beard","toHit":"","reach":"","hit":"","description":"Melee Weapon Attack: +5 to hit, reach 5 ft., one creature. Hit: 6 (1d8 + 2) piercing damage, and the target must succeed on a DC 12 Constitution saving throw or be poisoned for 1 minute. While poisoned in this way, the target can\u0027t regain hit points. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."},{"name":"Glaive","toHit":"","reach":"","hit":"","description":"Melee Weapon Attack: +5 to hit, reach 10 ft., one target. Hit: 8 (1d10 + 3) slashing damage. If the target is a creature other than an undead or a construct, it must succeed on a DC 12 Constitution saving throw or lose 5 (1d10) hit points at the start of each of its turns due to an infernal wound. Each time the devil hits the wounded target with this attack, the damage dealt by the wound increases by 5 (1d10). Any creature can take an action to stanch the wound with a successful DC 12 Wisdom (Medicine) check. The wound also closes if the target receives magical healing."}]}