{"name":"Chain Devil","abilityScores":[{"abilityType":"str","score":18},{"abilityType":"dex","score":15},{"abilityType":"con","score":18},{"abilityType":"int","score":11},{"abilityType":"wis","score":12},{"abilityType":"cha","score":14}],"stats":[{"statType":"ac","statValue":"16"},{"statType":"hp","statValue":"10d8+40"},{"statType":"speed","statValue":"30 ft."}],"features":[{"name":"Saves","description":"Con 7, Wis 4, Cha 5"},{"name":"DamageResistances","description":"cold, bludgeoning, piercing, and slashing from nonmagical weapons that aren\u0027t silvered"},{"name":"DamageImmunities","description":"fire, poison"},{"name":"ConditionImmunities","description":"poisoned"},{"name":"Senses","description":"darkvision 120 ft."},{"name":"Languages","description":"Infernal, telepathy 120 ft."},{"name":"Challenge Rating","description":"11"},{"name":"Devil\u0027s Sight","description":"Magical darkness doesn\u0027t impede the devil\u0027s darkvision."},{"name":"Magic Resistance","description":"The devil has advantage on saving throws against spells and other magical effects."},{"name":"Unnerving Mask","description":"When a creature the devil can see starts its turn within 30 feet of the devil, the devil can create the illusion that it looks like one of the creature\u0027s departed loved ones or bitter enemies. If the creature can see the devil, it must succeed on a DC 14 Wisdom saving throw or be frightened until the end of its turn."}],"actions":[{"name":"Multiattack","toHit":"","reach":"","hit":"","description":"The devil makes two attacks with its chains."},{"name":"Chain","toHit":"","reach":"","hit":"","description":"Melee Weapon Attack: +8 to hit, reach 10 ft., one target. Hit: 11 (2d6 + 4) slashing damage. The target is grappled (escape DC 14) if the devil isn\u0027t already grappling a creature. Until this grapple ends, the target is restrained and takes 7 (2d6) piercing damage at the start of each of its turns."},{"name":"Animate Chains (Recharges after a Short or Long Rest)","toHit":"","reach":"","hit":"","description":"Up to four chains the devil can see within 60 feet of it magically sprout razor-edged barbs and animate under the devil\u0027s control, provided that the chains aren\u0027t being worn or carried.\nEach animated chain is an object with AC 20, 20 hit points, resistance to piercing damage, and immunity to psychic and thunder damage. When the devil uses Multiattack on its turn, it can use each animated chain to make one additional chain attack. An animated chain can grapple one creature of its own but can\u0027t make attacks while grappling. An animated chain reverts to its inanimate state if reduced to 0 hit points or if the devil is incapacitated or dies."}]}