{"name":"Doppelganger","abilityScores":[{"abilityType":"str","score":11},{"abilityType":"dex","score":18},{"abilityType":"con","score":14},{"abilityType":"int","score":11},{"abilityType":"wis","score":12},{"abilityType":"cha","score":14}],"stats":[{"statType":"ac","statValue":"14"},{"statType":"hp","statValue":"8d8+16"},{"statType":"speed","statValue":"30 ft."}],"features":[{"name":"Skills","description":"Deception 6, Insight 3"},{"name":"DamageImmunities","description":"charmed"},{"name":"Senses","description":"darkvision 60 ft."},{"name":"Languages","description":"Common"},{"name":"Challenge Rating","description":"3"},{"name":"Shapechanger","description":"The doppelganger can use its action to polymorph into a Small or Medium humanoid it has seen, or back into its true form. Its statistics, other than its size, are the same in each form. Any equipment it is wearing or carrying isn\u0027t transformed. It reverts to its true form if it dies."},{"name":"Ambusher","description":"In the first round of a combat, the doppelganger has advantage on attack rolls against any creature it surprised"},{"name":"Surprise Attack","description":"If the doppelganger surprises a creature and hits it with an attack during the first round of combat, the target takes an extra 10 (3d6) damage from the attack."}],"actions":[{"name":"Multiattack","toHit":"","reach":"","hit":"","description":"The doppelganger makes two melee attacks."},{"name":"Slam","toHit":"","reach":"","hit":"","description":"Melee Weapon Attack: +6 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) bludgeoning damage."},{"name":"Read Thoughts","toHit":"","reach":"","hit":"","description":"The doppelganger magically reads the surface thoughts of one creature within 60 ft. of it. The effect can penetrate barriers, but 3 ft. of wood or dirt, 2 ft. of stone, 2 inches of metal, or a thin sheet of lead blocks it. While the target is in range, the doppelganger can continue reading its thoughts, as long as the doppelganger\u0027s concentration isn\u0027t broken (as if concentrating on a spell). While reading the target\u0027s mind, the doppelganger has advantage on Wisdom (Insight) and Charisma (Deception, Intimidation, and Persuasion) checks against the target."}]}