{"name":"Efreeti","abilityScores":[{"abilityType":"str","score":22},{"abilityType":"dex","score":12},{"abilityType":"con","score":24},{"abilityType":"int","score":16},{"abilityType":"wis","score":15},{"abilityType":"cha","score":16}],"stats":[{"statType":"ac","statValue":"17"},{"statType":"hp","statValue":"16d10+112"},{"statType":"speed","statValue":"40 ft.,fly 60 ft."}],"features":[{"name":"Saves","description":"Int 7, Wis 6, Cha 7"},{"name":"DamageImmunities","description":"fire"},{"name":"Senses","description":"darkvision 120 ft."},{"name":"Languages","description":"Ignan"},{"name":"Challenge Rating","description":"11"},{"name":"Elemental Demise","description":"If the efreeti dies, its body disintegrates in a flash of fire and puff of smoke, leaving behind only equipment the djinni was wearing or carrying."},{"name":"Innate Spellcasting","description":"The efreeti\u0027s innate spell casting ability is Charisma (spell save DC 15, +7 to hit with spell attacks). It can innately cast the following spells, requiring no material components: \n\nAt will: detect magic\n3/day: enlarge/reduce, tongues\n1/day each: conjure elemental (fire elemental only), gaseous form, invisibility, major image, plane shift, wall of fire"},{"name":"Variant: Genie Powers","description":"Genies have a variety of magical capabilities, including spells. A few have even greater powers that allow them to alter their appearance or the nature of reality.\n\nDisguises.\nSome genies can veil themselves in illusion to pass as other similarly shaped creatures. Such genies can innately cast the disguise self spell at will, often with a longer duration than is normal for that spell. Mightier genies can cast the true polymorph spell one to three times per day, possibly with a longer duration than normal. Such genies can change only their own shape, but a rare few can use the spell on other creatures and objects as well.\nWishes.\nThe genie power to grant wishes is legendary among mortals. Only the most potent genies, such as those among the nobility, can do so. A particular genie that has this power can grant one to three wishes to a creature that isn\u0027t a genie. Once a genie has granted its limit of wishes, it can\u0027t grant wishes again for some amount of time (usually 1 year). and cosmic law dictates that the same genie can expend its limit of wishes on a specific creature only once in that creature\u0027s existence.\nTo be granted a wish, a creature within 60 feet of the genie states a desired effect to it. The genie can then cast the wish spell on the creature\u0027s behalf to bring about the effect. Depending on the genie\u0027s nature, the genie might try to pervert the intent of the wish by exploiting the wish\u0027s poor wording. The perversion of the wording is usually crafted to be to the genie\u0027s benefit."}],"actions":[{"name":"Multiattack","toHit":"","reach":"","hit":"","description":"The efreeti makes two scimitar attacks or uses its Hurl Flame twice."},{"name":"Scimitar","toHit":"","reach":"","hit":"","description":"Melee Weapon Attack: +10 to hit, reach 5 ft., one target. Hit: 13 (2d6 + 6) slashing damage plus 7 (2d6) fire damage."},{"name":"Hurl Flame","toHit":"","reach":"","hit":"","description":"Ranged Spell Attack: +7 to hit, range 120 ft., one target. Hit: 17 (5d6) fire damage."}]}