{"name":"Lich","abilityScores":[{"abilityType":"str","score":11},{"abilityType":"dex","score":16},{"abilityType":"con","score":16},{"abilityType":"int","score":20},{"abilityType":"wis","score":14},{"abilityType":"cha","score":16}],"stats":[{"statType":"ac","statValue":"17"},{"statType":"hp","statValue":"18d8+54"},{"statType":"speed","statValue":"30 ft."}],"features":[{"name":"Saves","description":"Con 10, Int 12, Wis 9"},{"name":"Skills","description":"Arcana 18, History 12, Insight 9, Perception 9"},{"name":"DamageResistances","description":"cold, lightning, necrotic"},{"name":"DamageImmunities","description":"poison, bludgeoning, piercing, and slashing from nonmagical weapons"},{"name":"ConditionImmunities","description":"charmed, exhaustion, frightened, paralyzed, poisoned"},{"name":"Senses","description":"truesight 120 ft."},{"name":"Languages","description":"Common plus up to five other languages"},{"name":"Challenge Rating","description":"21"},{"name":"Legendary Resistance (3/Day)","description":"If the lich fails a saving throw, it can choose to succeed instead."},{"name":"Rejuvenation","description":"If it has a phylactery, a destroyed lich gains a new body in 1d10 days, regaining all its hit points and becoming active again. The new body appears within 5 feet of the phylactery."},{"name":"Spellcasting","description":"The lich is an 18th-level spellcaster. Its spellcasting ability is Intelligence (spell save DC 20, +12 to hit with spell attacks). The lich has the following wizard spells prepared: \n\n• Cantrips (at will): mage hand, prestidigitation, ray of frost\n• 1st level (4 slots): detect magic, magic missile, shield, thunderwave\n• 2nd level (3 slots): detect thoughts, invisibility, Melf\u0027s acid arrow, mirror image\n• 3rd level (3 slots): animate dead, counterspell, dispel magic, fireball\n• 4th level (3 slots): blight, dimension door\n• 5th level (3 slots): cloudkill, scrying\n• 6th level (1 slot): disintegrate, globe of invulnerability\n• 7th level (1 slot): finger of death, plane shift\n• 8th level (1 slot): dominate monster, power word stun\n• 9th level (1 slot): power word kill"},{"name":"Turn Resistance","description":"The lich has advantage on saving throws against any effect that turns undead."}],"actions":[{"name":"Paralyzing Touch","toHit":"","reach":"","hit":"","description":"Melee Spell Attack: +12 to hit, reach 5 ft., one creature. Hit: 10 (3d6) cold damage. The target must succeed on a DC 18 Constitution saving throw or be paralyzed for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."},{"name":"Cantrip","toHit":"","reach":"","hit":"","description":"The lich casts a cantrip."},{"name":"Paralyzing Touch (Costs 2 Actions)","toHit":"","reach":"","hit":"","description":"The lich uses its Paralyzing Touch."},{"name":"Frightening Gaze (Costs 2 Actions)","toHit":"","reach":"","hit":"","description":"The lich fixes its gaze on one creature it can see within 10 feet of it. The target must succeed on a DC 18 Wisdom saving throw against this magic or become frightened for 1 minute. The frightened target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success. If a target\u0027s saving throw is successful or the effect ends for it, the target is immune to the lich\u0027s gaze for the next 24 hours."},{"name":"Disrupt Life (Costs 3 Actions)","toHit":"","reach":"","hit":"","description":"Each non-undead creature within 20 feet of the lich must make a DC 18 Constitution saving throw against this magic, taking 21 (6d6) necrotic damage on a failed save, or half as much damage on a successful one."}]}