{"name":"Rakshasa","abilityScores":[{"abilityType":"str","score":14},{"abilityType":"dex","score":17},{"abilityType":"con","score":18},{"abilityType":"int","score":13},{"abilityType":"wis","score":16},{"abilityType":"cha","score":20}],"stats":[{"statType":"ac","statValue":"16"},{"statType":"hp","statValue":"13d8+52"},{"statType":"speed","statValue":"40 ft."}],"features":[{"name":"Skills","description":"Deception 10, Insight 8"},{"name":"DamageVulnerabilities","description":"piercing from magic weapons wielded by good creatures"},{"name":"DamageImmunities","description":"bludgeoning, piercing, and slashing from nonmagical weapons"},{"name":"Senses","description":"darkvision 60 ft."},{"name":"Languages","description":"Common, Infernal"},{"name":"Challenge Rating","description":"13"},{"name":"Limited Magic Immunity","description":"The rakshasa can\u0027t be affected or detected by spells of 6th level or lower unless it wishes to be. It has advantage on saving throws against all other spells and magical effects."},{"name":"Innate Spellcasting","description":"The rakshasa\u0027s innate spellcasting ability is Charisma (spell save DC 18, +10 to hit with spell attacks). The rakshasa can innately cast the following spells, requiring no material components: \n\nAt will: detect thoughts, disguise self, mage hand, minor illusion\n3/day each: charm person, detect magic, invisibility, major image, suggestion\n1/day each: dominate person, fly, plane shift, true seeing"}],"actions":[{"name":"Multiattack","toHit":"","reach":"","hit":"","description":"The rakshasa makes two claw attacks"},{"name":"Claw","toHit":"","reach":"","hit":"","description":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 9 (2d6 + 2) slashing damage, and the target is cursed if it is a creature. The magical curse takes effect whenever the target takes a short or long rest, filling the target\u0027s thoughts with horrible images and dreams. The cursed target gains no benefit from finishing a short or long rest. The curse lasts until it is lifted by a remove curse spell or similar magic."}]}