{"name":"Troll","abilityScores":[{"abilityType":"str","score":18},{"abilityType":"dex","score":13},{"abilityType":"con","score":20},{"abilityType":"int","score":7},{"abilityType":"wis","score":9},{"abilityType":"cha","score":7}],"stats":[{"statType":"ac","statValue":"15"},{"statType":"hp","statValue":"8d10+40"},{"statType":"speed","statValue":"30 ft."}],"features":[{"name":"Skills","description":"Perception 2"},{"name":"Senses","description":"darkvision 60 ft."},{"name":"Languages","description":"Giant"},{"name":"Challenge Rating","description":"5"},{"name":"Keen Smell","description":"The troll has advantage on Wisdom (Perception) checks that rely on smell."},{"name":"Regeneration","description":"The troll regains 10 hit points at the start of its turn. If the troll takes acid or fire damage, this trait doesn\u0027t function at the start of the troll\u0027s next turn. The troll dies only if it starts its turn with 0 hit points and doesn\u0027t regenerate."},{"name":"Variant: Loathsome Limbs","description":"Whenever the troll takes at least 15 slashing damage at one time, roll a d20 to determine what else happens to it: \n1-10: Nothing else happens.\n11-14: One leg is severed from the troll if it has any legs left.\n15- 18: One arm is severed from the troll if it has any arms left.\n19-20: The troll is decapitated, but the troll dies only if it can\u0027t regenerate. If it dies, so does the severed head.\nIf the troll finishes a short or long rest without reattaching a severed limb or head, the part regrows. At that point, the severed part dies. Until then, a severed part acts on the troll\u0027s initiative and has its own action and movement. A severed part has AC 13, 10 hit points, and the troll\u0027s Regeneration trait.\nA severed leg is unable to attack and has a speed of 5 feet.\nA severed arm has a speed of 5 feet and can make one claw attack on its turn, with disadvantage on the attack roll unless the troll can see the arm and its target. Each time the troll loses an arm, it loses a claw attack.\nIf its head is severed, the troll loses its bite attack and its body is blinded unless the head can see it. The severed head has a speed of 0 feet and the troll\u0027s Keen Smell trait. It can make a bite attack but only against a target in its space.\nThe troll\u0027s speed is halved if it\u0027s missing a leg. If it loses both legs, it falls prone. If it has both arms, it can crawl. With only one arm, it can still crawl, but its speed is halved. With no arms or legs, its speed is 0, and it can\u0027t benefit from bonuses to speed."}],"actions":[{"name":"Multiattack","toHit":"","reach":"","hit":"","description":"The troll makes three attacks: one with its bite and two with its claws."},{"name":"Bite","toHit":"","reach":"","hit":"","description":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 7 (1d6 + 4) piercing damage."},{"name":"Claw","toHit":"","reach":"","hit":"","description":"Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 11 (2d6 + 4) slashing damage."}]}